InformationRegisters/ТелеграмУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмУведомления</Name>
			<Comment>История уведомлений менеджеру в Telegram: что, когда, по какому заказу и в какой чат ушло, и нажал ли менеджер кнопку "Обработан". Пишется из ТелеграмБот.ОтправитьСообщение, отметка обработки - из ТелеграмБот.ПолучитьОтветы (регламент ТелеграмОтветы). Ключ записи - чат + номер сообщения в этом чате.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУведомления</Name>
					<Comment>НовыйЗаказ - заказ только что загружен с сайта; ПросрочкаСтатуса - заказ висит в статусе дольше нормы.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача менеджера, в которую кнопка "Обработан" допишет строку с датой обработки. У уведомлений о новых заказах задачи нет.</Comment>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачиПользователя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Comment>Текст сообщения в том виде, в каком он ушёл в Telegram (разметка HTML).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Comment>Менеджер нажал в Telegram кнопку "Обработан".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КтоОбработал</Name>
					<Comment>Имя и @username того, кто нажал кнопку в Telegram.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Comment>chat_id получателя.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Comment>message_id в чате Telegram. Вместе с чатом однозначно определяет сообщение - по нему кнопка "Обработан" находит свою запись.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтатусыЗаказов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМСПриУстановке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьРеализацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСрокНахожденияНаСкладе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСМС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМСПоШаблону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВозвратТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВозвратДенег</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВСтатусе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьСхемуРезервирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРезервирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыРезервирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачуНаОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВнПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаВнПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачуСрокХранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСрокХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаГруппеПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьМаркетПлэйс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрыватьРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТелеграм</Name>
					<Comment>Уведомление уходит в тот же момент, когда создаётся задача просрочки статуса.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмЧат</Name>
					<Comment>Кому слать уведомление о просрочке этого статуса. Один или несколько chat_id через запятую - уйдёт каждому. Заполнено - шлём (галка "Отправлять в Telegram" при этом не обязательна); пусто и галка стоит - берём чат от статуса, где он заполнен. chat_id узнаётся один раз: получатель нажимает Start у бота, затем chat_id виден в журнале регистрации, событие "Телеграм.Чаты".</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмЧатСмены</Name>
					<Comment>Второй сценарий: написать менеджеру СРАЗУ, как заказ перешёл в этот статус (реквизит "Телеграм: чаты" - про просрочку, то есть "висит дольше нормы"). Один или несколько chat_id через запятую, пусто - при смене не пишем. Отправка идёт не из транзакции записи заказа, а через очередь ТелеграмОчередь, которую разбирает регламент ТелеграмОбмен.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредыдущиеСтатусыУсловиеОтправкиСМС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТелеграмБот/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Уведомления менеджеру в Telegram.
//
// Работает через ОТДЕЛЬНОГО бота 1С (не через бота сайта Cvetkovbot):
// у getUpdates может быть только один потребитель, и вебхук сайта мы трогать не можем.
// Токен зашит в функции ТокенБота() - как ключ обмена в ОплатаПоСсылке.
//
// Кому слать - задаётся в справочнике "Статусы заказов" (реквизиты
// "Отправлять в Telegram" и "Телеграм: чат"). Отправка происходит в момент,
// когда БИАС.ПроверкаЗадачь создаёт задачу просрочки статуса, то есть по тем же
// правилам ("Дней в статусе"), что и задача менеджеру.
//
// Второй повод для сообщения - НОВЫЙ заказ с сайта: УведомитьОНовомЗаказе()
// вызывается из ОбменПокупателямиНашСайт.ЗагрузитьЗаказ сразу после записи
// документа, один раз на заказ (повторный файл order-<id>.xml из админки до
// этого места не доходит - заказ уже найден по НомерЗаказа2ССайта).
//
// Уведомления шлём ТОЛЬКО по рознице - тип цен заказа из КодыТиповЦенРозницы().
// Опт, совместные покупки, дропшиппинг и представники молчат: менеджеру нужны
// звонки по розничным заказам, оптом занимаются отдельно.
//
// Вне рабочих часов (см. РабочееВремя) сообщение уходит беззвучно
// (disable_notification): оно доставляется и висит непрочитанным, но ночью
// не будит менеджера.
//
// История отправок: регистр сведений ТелеграмУведомления - там же отметка
// "Обработан" (менеджер жмёт кнопку под сообщением, нажатия забирает регламент
// ТелеграмОтветы). Это источник истины. Копия уезжает на сайт, во вкладку
// админки "Уведомления 1С" (ЗеркалитьНаСайт -> shop/cron_manager_notify.php),
// чтобы историю можно было смотреть из браузера; недоступный сайт на отправку
// и на отметку в 1С не влияет.
//
// Кнопок в сообщении нет: менеджеру нужно только позвонить, поэтому телефон
// клиента выводится отдельной строкой в формате +380... - Telegram сам делает
// его кликабельным (tap = звонок). Кнопкой это сделать нельзя: inline-кнопки
// Telegram принимают только http(s)/tg-ссылки, схему tel: API отклоняет.
//
// Разовая привязка получателя: получатель нажимает Start у бота,
// затем ПоказатьНовыеЧаты() выводит его chat_id в журнал регистрации.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Отправляет в Telegram уведомление о заказе.
//
// Параметры:
//  Заказ  - ДокументСсылка.ЗаказПокупателя - заказ, о котором уведомляем.
//  Статус - СправочникСсылка.СтатусыЗаказов - статус, чьи настройки берём (чат получателя).
//         - Неопределено - берём статус самого заказа.
//  ЧатИД  - Строка - явный получатель; если не задан, берётся из настроек статуса.
//  Задача - ЗадачаСсылка.ЗадачиПользователя - задача, в которую кнопка "Обработан"
//           запишет дату обработки. Не задана - кнопка просто отмечает сообщение.
//
// Возвращаемое значение:
//  Булево - сообщение принято Telegram.
//
Функция УведомитьОЗаказе(Заказ, Знач Статус = Неопределено, Знач ЧатИД = "",
	Знач Задача = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Если Статус = Неопределено Тогда
		Статус = Заказ.СтатусЗаказа;
	КонецЕсли;

	// Опт, СП, дропшиппинг и представники менеджеру в Telegram не приходят.
	Если Не ЭтоРозничныйЗаказ(Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ПустаяСтрока(ЧатИД) И ЗначениеЗаполнено(Статус) Тогда
		ЧатИД = СокрЛП(Строка(Статус.ТелеграмЧат));
	КонецЕсли;

	// Пока реквизит не выведен на форму статуса, получателя можно задать в коде.
	Если ПустаяСтрока(ЧатИД) Тогда
		ЧатИД = ЧатПоУмолчанию();
	КонецЕсли;

	Если ПустаяСтрока(ЧатИД) Тогда
		ЗаписатьОшибку(Заказ, "Не заполнен ""Телеграм: чат"" у статуса " + Строка(Статус)
			+ " - уведомление не отправлено.");
		Возврат Ложь;
	КонецЕсли;

	Возврат ОтправитьСообщение(ЧатИД, ТекстПоЗаказу(Заказ, Статус), Заказ,
		"ПросрочкаСтатуса", Задача);

КонецФункции

// Отправляет в Telegram уведомление о новом заказе с сайта - чтобы менеджер позвонил.
// Вызывается из ОбменПокупателямиНашСайт.ЗагрузитьЗаказ сразу после записи документа.
//
// Шлём только по розничным заказам (см. ЭтоРозничныйЗаказ). Получатель ищется по
// цепочке: явный параметр -> ЧатНовыхЗаказов() -> чат статуса заказа -> первый чат,
// настроенный в справочнике "Статусы заказов" -> ЧатПоУмолчанию().
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - только что загруженный заказ.
//  ЧатИД - Строка - явный получатель.
//
// Возвращаемое значение:
//  Булево - сообщение принято Telegram.
//
Функция УведомитьОНовомЗаказе(Заказ, Знач ЧатИД = "") Экспорт

	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Если Не ЭтоРозничныйЗаказ(Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ПустаяСтрока(ЧатИД) Тогда
		ЧатИД = ЧатНовыхЗаказов();
	КонецЕсли;

	Если ПустаяСтрока(ЧатИД) И ЗначениеЗаполнено(Заказ.СтатусЗаказа) Тогда
		ЧатИД = СокрЛП(Строка(Заказ.СтатусЗаказа.ТелеграмЧат));
	КонецЕсли;

	Если ПустаяСтрока(ЧатИД) Тогда
		ЧатИД = ПервыйНастроенныйЧат();
	КонецЕсли;

	Если ПустаяСтрока(ЧатИД) Тогда
		ЧатИД = ЧатПоУмолчанию();
	КонецЕсли;

	Если ПустаяСтрока(ЧатИД) Тогда
		ЗаписатьОшибку(Заказ, "Некому отправить уведомление о новом заказе: ни у одного"
			+ " статуса не заполнен ""Телеграм: чат получателя"".");
		Возврат Ложь;
	КонецЕсли;

	Текст = ТекстПоЗаказу(Заказ, Заказ.СтатусЗаказа,
		"🆕 <b>НОВЫЙ ЗАКАЗ С САЙТА</b> - нужно позвонить");

	Возврат ОтправитьСообщение(ЧатИД, Текст, Заказ, "НовыйЗаказ");

КонецФункции

// Отправляет произвольное сообщение в Telegram.
//
// Параметры:
//  ЧатИД          - Строка - chat_id получателя.
//  Текст          - Строка - текст сообщения в разметке HTML (Telegram), не длиннее 4096 символов.
//  Заказ          - ДокументСсылка.ЗаказПокупателя - для журнала регистрации и кнопки "Обработан".
//                 - Неопределено
//  ВидУведомления - Строка - "НовыйЗаказ" / "ПросрочкаСтатуса" / "" - для истории отправок.
//                   Пустой вид - сообщение без кнопки и без записи в историю.
//  Задача         - ЗадачаСсылка.ЗадачиПользователя - куда кнопка запишет дату обработки.
//                 - Неопределено
//
// Возвращаемое значение:
//  Булево - сообщение принято Telegram.
//
Функция ОтправитьСообщение(Знач ЧатИД, Знач Текст, Знач Заказ = Неопределено,
	Знач ВидУведомления = "", Знач Задача = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Токен = ТокенБота();
	Если ПустаяСтрока(Токен) Тогда
		ЗаписатьОшибку(Заказ, "Не заполнен токен бота (функция ТокенБота).");
		Возврат Ложь;
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(Текст)) Тогда
		Возврат Ложь;
	КонецЕсли;

	// Лимит Telegram на длину сообщения - 4096 символов.
	Если СтрДлина(Текст) > 4000 Тогда
		Текст = Лев(Текст, 3990) + "...";
	КонецЕсли;

	Параметры = Новый Структура;
	Параметры.Вставить("chat_id", СокрЛП(Строка(ЧатИД)));
	Параметры.Вставить("text", Текст);
	Параметры.Вставить("parse_mode", "HTML");
	Параметры.Вставить("disable_web_page_preview", Истина);

	// Ночью сообщение всё равно доставляется, но беззвучно - менеджера не будим.
	Параметры.Вставить("disable_notification", Не РабочееВремя());

	// Кнопка "Обработан" имеет смысл только по конкретному заказу: в callback_data
	// уезжает его уникальный идентификатор, по нему ПолучитьОтветы() находит заказ
	// и задачу. Лимит Telegram на callback_data - 64 байта, UUID в него влезает.
	Если ЗначениеЗаполнено(Заказ) И Не ПустаяСтрока(ВидУведомления) Тогда
		Параметры.Вставить("reply_markup", КлавиатураОбработан(Заказ));
	КонецЕсли;

	Ответ = ВыполнитьЗапрос(Токен, "sendMessage", ВJSON(Параметры), Заказ);

	Если Ответ = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Не БулевоJSON(Ответ, "ok") Тогда
		ЗаписатьОшибку(Заказ, "Telegram отклонил сообщение: "
			+ СтрокаJSON(Ответ, "description")
			+ " (чат " + СокрЛП(Строка(ЧатИД)) + ")");
		Возврат Ложь;
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Телеграм.Отправлено",
		УровеньЖурналаРегистрации.Информация,
		?(ЗначениеЗаполнено(Заказ), Метаданные.Документы.ЗаказПокупателя, Неопределено),
		Заказ,
		"Чат " + СокрЛП(Строка(ЧатИД)) + Символы.ПС + Текст);

	Если Не ПустаяСтрока(ВидУведомления) Тогда

		ЗаписатьВИсторию(
			ЧатИД,
			НомерСообщенияИзОтвета(Ответ),
			Заказ,
			ВидУведомления,
			Текст,
			Задача);

		ЗеркалитьНаСайт(Заказ, ВидУведомления, Текст);

	КонецЕсли;

	Возврат Истина;

КонецФункции

// Собирает текст уведомления по заказу: номер, товары, тип оплаты, получатель, телефон.
//
// Параметры:
//  Заказ     - ДокументСсылка.ЗаказПокупателя - заказ.
//  Статус    - СправочникСсылка.СтатусыЗаказов - статус для заголовка.
//            - Неопределено
//  Заголовок - Строка - строка в разметке HTML перед номером заказа
//              (например "🆕 <b>НОВЫЙ ЗАКАЗ С САЙТА</b>"). Уже готовая разметка,
//              экранированию не подлежит.
//
// Возвращаемое значение:
//  Строка - текст в разметке HTML (Telegram).
//
Функция ТекстПоЗаказу(Заказ, Знач Статус = Неопределено, Знач Заголовок = "") Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если Статус = Неопределено Тогда
		Статус = Заказ.СтатусЗаказа;
	КонецЕсли;

	Текст = "";

	Если Не ПустаяСтрока(Заголовок) Тогда
		Текст = Заголовок + Символы.ПС + Символы.ПС;
	КонецЕсли;

	Текст = Текст + "<b>Заказ № " + HTML(СокрЛП(Заказ.Номер)) + "</b>"
		+ " от " + Формат(Заказ.Дата, "ДФ=dd.MM.yyyy");

	Если ЗначениеЗаполнено(Статус) Тогда
		Текст = Текст + Символы.ПС + "Статус: " + HTML(Строка(Статус));
	КонецЕсли;

	НомерСайта = СокрЛП(Строка(Заказ.НомерЗаказа2ССайта));
	Если Не ПустаяСтрока(НомерСайта) Тогда
		Текст = Текст + Символы.ПС + "Номер на сайте: " + HTML(НомерСайта);
	КонецЕсли;

	Текст = Текст + Символы.ПС + Символы.ПС + "<b>Товар:</b>";

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказТовары.Номенклатура.Наименование КАК Номенклатура,
		|	ЗаказТовары.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ЗаказТовары.Количество КАК Количество,
		|	ЗаказТовары.Цена КАК Цена,
		|	ЗаказТовары.Сумма КАК Сумма
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказТовары
		|ГДЕ
		|	ЗаказТовары.Ссылка = &Заказ
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказТовары.НомерСтроки";
	Запрос.УстановитьПараметр("Заказ", Заказ);

	Выборка = Запрос.Выполнить().Выбрать();

	Позиций = 0;
	Пока Выборка.Следующий() Цикл

		Позиций = Позиций + 1;

		// Больше 20 позиций в сообщение не влезет - остальное менеджер смотрит в 1С.
		Если Позиций > 20 Тогда
			Текст = Текст + Символы.ПС + "... и ещё позиции - смотрите заказ в 1С.";
			Прервать;
		КонецЕсли;

		СтрокаТовара = "• " + HTML(СокрЛП(Строка(Выборка.Номенклатура)));

		Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
			СтрокаТовара = СтрокаТовара + " (" + HTML(СокрЛП(Строка(Выборка.Характеристика))) + ")";
		КонецЕсли;

		СтрокаТовара = СтрокаТовара
			+ " - " + Формат(Выборка.Количество, "ЧДЦ=3; ЧН=0; ЧГ=0") + " шт"
			+ " x " + Формат(Выборка.Цена, "ЧДЦ=2; ЧН=0; ЧГ=0")
			+ " = " + Формат(Выборка.Сумма, "ЧДЦ=2; ЧН=0; ЧГ=0");

		Текст = Текст + Символы.ПС + СтрокаТовара;

	КонецЦикла;

	Если Позиций = 0 Тогда
		Текст = Текст + Символы.ПС + "• (в заказе нет товаров)";
	КонецЕсли;

	Текст = Текст + Символы.ПС + Символы.ПС
		+ "<b>Сумма:</b> " + Формат(Заказ.СуммаДокумента, "ЧДЦ=2; ЧН=0; ЧГ=0") + " грн";

	Если ЗначениеЗаполнено(Заказ.ВидОплатыЗаказа) Тогда
		Текст = Текст + Символы.ПС + "<b>Тип оплаты:</b> " + HTML(Строка(Заказ.ВидОплатыЗаказа));
	КонецЕсли;

	Текст = Текст + Символы.ПС + Символы.ПС + "<b>Получатель:</b>";

	Получатель = СокрЛП(Строка(Заказ.Получатель));
	Если ПустаяСтрока(Получатель) Тогда
		Получатель = СокрЛП(Строка(Заказ.Контрагент));
	КонецЕсли;
	Текст = Текст + Символы.ПС + HTML(Получатель);

	Доставка = АдресДоставки(Заказ);
	Если Не ПустаяСтрока(Доставка) Тогда
		Текст = Текст + Символы.ПС + HTML(Доставка);
	КонецЕсли;

	// Телефон отдельной строкой в международном формате: Telegram сам делает его
	// кликабельным, тап по номеру = звонок.
	Телефон = ТелефонДляЗвонка(Заказ);
	Если Не ПустаяСтрока(Телефон) Тогда
		Текст = Текст + Символы.ПС + Символы.ПС + "Позвонить: " + HTML(Телефон);
	Иначе
		Текст = Текст + Символы.ПС + Символы.ПС + "Телефон не заполнен - смотрите карточку клиента.";
	КонецЕсли;

	Возврат Текст;

КонецФункции

// Розничный ли заказ. Уведомления менеджеру шлём только по рознице: опт,
// совместные покупки, дропшиппинг и представники ведутся отдельно и звонка
// по каждому заказу не требуют.
//
// Признак - тип цен заказа (см. КодыТиповЦенРозницы). Тип цен приходит из группы
// контрагента (ОбменПокупателямиНашСайт: ТипЦен = Контрагент.Родитель.ТипЦеныГруппы),
// поэтому он же отделяет розничного клиента от оптового и в заказах, заведённых
// менеджером руками.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ.
//
// Возвращаемое значение:
//  Булево - заказ розничный.
//
Функция ЭтоРозничныйЗаказ(Заказ) Экспорт

	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	КодТипаЦен = СокрЛП(Строка(Заказ.ТипЦен.Код));

	Если ПустаяСтрока(КодТипаЦен) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат СтрНайти(КодыТиповЦенРозницы(), "," + КодТипаЦен + ",") > 0;

КонецФункции

// Забирает из Telegram нажатия кнопки "Обработан" и проставляет отметку.
// Вызывается регламентным заданием ТелеграмОтветы (расписание задаётся в базе,
// в метаданных оно не хранится) - имеет смысл раз в 1-2 минуты.
//
// Что делает одно нажатие:
//  - в регистре ТелеграмУведомления ставит "Обработан", дату и того, кто нажал;
//  - в задаче менеджера дописывает строкой "✅ Обработан в Telegram <дата>"
//    и заполняет "Дату исполнения", если она была пуста (задачу НЕ закрывает);
//  - меняет подпись кнопки под сообщением на "✅ Обработан <дата>".
//
// Смещение обновлений (offset) в базе не храним: Telegram отдаёт обновления до
// тех пор, пока не запросишь getUpdates с offset больше последнего update_id.
// Этим повторным запросом в конце процедуры пачка и подтверждается. Обратная
// сторона: обновления вычитывает уже этот регламент, и ПоказатьНовыеЧаты() их
// не увидит - поэтому новые чаты пишет в журнал сама эта процедура.
//
Процедура ПолучитьОтветы() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Токен = ТокенБота();
	Если ПустаяСтрока(Токен) Тогда
		Возврат;
	КонецЕсли;

	Ответ = ВыполнитьЗапрос(Токен, "getUpdates", "{""limit"":100,""timeout"":0}", Неопределено);

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СписокОбновлений = Неопределено;
	Если Не Ответ.Свойство("result", СписокОбновлений)
		Или ТипЗнч(СписокОбновлений) <> Тип("Массив")
		Или СписокОбновлений.Количество() = 0 Тогда

		Возврат;

	КонецЕсли;

	МаксимальныйИД = 0;
	НовыеЧаты      = "";

	Для Каждого Обновление Из СписокОбновлений Цикл

		Если ТипЗнч(Обновление) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;

		ИДОбновления = ЧислоJSON(Обновление, "update_id");
		Если ИДОбновления > МаксимальныйИД Тогда
			МаксимальныйИД = ИДОбновления;
		КонецЕсли;

		Нажатие = Неопределено;
		Если Обновление.Свойство("callback_query", Нажатие)
			И ТипЗнч(Нажатие) = Тип("Структура") Тогда

			Попытка
				ОбработатьНажатие(Токен, Нажатие);
			Исключение
				// Одно кривое нажатие не должно останавливать разбор пачки.
				ЗаписатьОшибку(Неопределено, "Не удалось обработать нажатие кнопки: "
					+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;

			Продолжить;

		КонецЕсли;

		Сообщение = Неопределено;
		Если Обновление.Свойство("message", Сообщение)
			И ТипЗнч(Сообщение) = Тип("Структура") Тогда

			Чат = Неопределено;
			Если Сообщение.Свойство("chat", Чат) И ТипЗнч(Чат) = Тип("Структура") Тогда

				НовыеЧаты = НовыеЧаты
					+ "chat_id: " + СтрокаJSON(Чат, "id")
					+ "; " + СтрокаJSON(Чат, "first_name")
					+ " " + СтрокаJSON(Чат, "last_name")
					+ " @" + СтрокаJSON(Чат, "username")
					+ Символы.ПС;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если Не ПустаяСтрока(НовыеЧаты) Тогда
		ЗаписьЖурналаРегистрации("Телеграм.Чаты",
			УровеньЖурналаРегистрации.Информация, , , НовыеЧаты);
	КонецЕсли;

	Если МаксимальныйИД > 0 Тогда

		ВыполнитьЗапрос(Токен, "getUpdates",
			"{""offset"":" + Формат(МаксимальныйИД + 1, "ЧЦ=15; ЧДЦ=0; ЧГ=0")
			+ ",""limit"":1,""timeout"":0}",
			Неопределено);

	КонецЕсли;

КонецПроцедуры

// Выводит в журнал регистрации чаты, которые написали боту (кнопка Start).
// Нужна один раз, чтобы узнать chat_id получателя и вписать его в статус заказа.
// Запускается из консоли кода: ТелеграмБот.ПоказатьНовыеЧаты();
//
// Если регламент ТелеграмОтветы уже включён, обновления вычитывает он - тогда
// смотрите чаты в журнале регистрации по событию "Телеграм.Чаты".
//
// Возвращаемое значение:
//  Строка - тот же список, что и в журнале регистрации.
//
Функция ПоказатьНовыеЧаты() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Токен = ТокенБота();
	Если ПустаяСтрока(Токен) Тогда
		Возврат "Не заполнен токен бота (функция ТокенБота).";
	КонецЕсли;

	Ответ = ВыполнитьЗапрос(Токен, "getUpdates", "{""limit"":100}", Неопределено);

	Если Ответ = Неопределено Тогда
		Возврат "Telegram не ответил - смотрите событие журнала ""Телеграм.Ошибка"".";
	КонецЕсли;

	СписокОбновлений = Неопределено;
	Если Не Ответ.Свойство("result", СписокОбновлений) Или ТипЗнч(СписокОбновлений) <> Тип("Массив") Тогда
		Возврат "Telegram вернул неожиданный ответ.";
	КонецЕсли;

	Результат = "";

	Для Каждого Обновление Из СписокОбновлений Цикл

		Сообщение = Неопределено;
		Если Не Обновление.Свойство("message", Сообщение) Или ТипЗнч(Сообщение) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;

		Чат = Неопределено;
		Если Не Сообщение.Свойство("chat", Чат) Или ТипЗнч(Чат) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;

		Результат = Результат
			+ "chat_id: " + СтрокаJSON(Чат, "id")
			+ "; " + СтрокаJSON(Чат, "first_name")
			+ " " + СтрокаJSON(Чат, "last_name")
			+ " @" + СтрокаJSON(Чат, "username")
			+ Символы.ПС;

	КонецЦикла;

	Если ПустаяСтрока(Результат) Тогда
		Результат = "Боту никто не писал (или обновления уже вычитаны). "
			+ "Попросите получателя нажать Start и повторите.";
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Телеграм.Чаты",
		УровеньЖурналаРегистрации.Информация, , , Результат);

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Токен бота 1С (@BotFather). Зашит в коде, как ключ обмена в ОплатаПоСсылке.
// Если токен придётся перевыпустить - меняется только эта строка.
Функция ТокенБота()

	Возврат "7991351655:AAEvdG50cjIH4WadLmbtcxJ1pqHdgHv8gss";

КонецФункции

// Получатель уведомлений, когда у статуса не заполнен реквизит "Телеграм: чат получателя"
// (например, поле ещё не выведено на форму). Пусто - шлём только по настройке статуса.
Функция ЧатПоУмолчанию()

	Возврат "";

КонецФункции

// Отдельный чат для уведомлений о новых заказах с сайта. Пусто - берём тот же
// чат, что и у уведомлений по статусам (см. УведомитьОНовомЗаказе).
Функция ЧатНовыхЗаказов()

	Возврат "";

КонецФункции

// Коды типов цен номенклатуры, которые считаем розницей. Список через запятую,
// с запятыми по краям - так поиск подстроки не цепляет соседний код.
// Розница - 000000020. Если розничных типов цен станет больше, дописываются сюда.
Функция КодыТиповЦенРозницы()

	Возврат ",000000020,";

КонецФункции

// Ночью (вне 9:00-21:00 по времени сервера) сообщение уходит беззвучно: оно всё
// равно доставляется и висит непрочитанным, но менеджера не будит. Часы работы
// регламентов от этого не зависят - они задаются расписанием в базе.
Функция РабочееВремя()

	ТекущийЧас = Час(ТекущаяДата());

	Возврат ТекущийЧас >= 9 И ТекущийЧас < 21;

КонецФункции

// Первый чат, настроенный хоть у одного статуса заказов - чтобы уведомление о
// новом заказе было кому отправить, пока для него не завели отдельный чат.
Функция ПервыйНастроенныйЧат()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатусыЗаказов.ТелеграмЧат КАК ТелеграмЧат
		|ИЗ
		|	Справочник.СтатусыЗаказов КАК СтатусыЗаказов
		|ГДЕ
		|	СтатусыЗаказов.ОтправлятьВТелеграм
		|	И СтатусыЗаказов.ТелеграмЧат <> """"
		|	И НЕ СтатусыЗаказов.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	СтатусыЗаказов.Код";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Строка(Выборка.ТелеграмЧат));
	КонецЕсли;

	Возврат "";

КонецФункции

// Разметка кнопки "Обработан" под сообщением. В callback_data уезжает
// уникальный идентификатор заказа - по нему ПолучитьОтветы() находит заказ.
// Лимит Telegram на callback_data - 64 байта, "ok:" + UUID укладывается в 39.
Функция КлавиатураОбработан(Знач Заказ)

	Кнопка = Новый Структура;
	Кнопка.Вставить("text", "✅ Обработан");
	Кнопка.Вставить("callback_data", "ok:" + Строка(Заказ.УникальныйИдентификатор()));

	Ряд = Новый Массив;
	Ряд.Добавить(Кнопка);

	Клавиатура = Новый Массив;
	Клавиатура.Добавить(Ряд);

	Разметка = Новый Структура;
	Разметка.Вставить("inline_keyboard", Клавиатура);

	Возврат Разметка;

КонецФункции

// Номер отправленного сообщения (message_id) из ответа sendMessage.
Функция НомерСообщенияИзОтвета(Знач Ответ)

	Результат = Неопределено;

	Если Не Ответ.Свойство("result", Результат) Или ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат 0;
	КонецЕсли;

	Возврат ЧислоJSON(Результат, "message_id");

КонецФункции

// Пишет отправленное сообщение в историю (регистр ТелеграмУведомления).
// История не должна ронять отправку: сообщение менеджеру уже ушло.
Процедура ЗаписатьВИсторию(Знач ЧатИД, Знач НомерСообщения, Знач Заказ,
	Знач ВидУведомления, Знач Текст, Знач Задача)

	Если НомерСообщения = 0 Или ПустаяСтрока(СокрЛП(Строка(ЧатИД))) Тогда
		Возврат;
	КонецЕсли;

	Попытка

		Запись = РегистрыСведений.ТелеграмУведомления.СоздатьМенеджерЗаписи();

		Запись.Заказ = ?(ЗначениеЗаполнено(Заказ),
			Заказ, Документы.ЗаказПокупателя.ПустаяСсылка());

		Запись.Чат            = Лев(СокрЛП(Строка(ЧатИД)), 32);
		Запись.НомерСообщения = НомерСообщения;
		Запись.ДатаОтправки   = ТекущаяДата();
		Запись.ВидУведомления = Лев(ВидУведомления, 30);
		Запись.Текст          = Текст;
		Запись.Обработан      = Ложь;

		Если ЗначениеЗаполнено(Задача) Тогда
			Запись.Задача = Задача;
		КонецЕсли;

		Запись.Записать(Истина);

	Исключение

		ЗаписьЖурналаРегистрации("Телеграм.Ошибка",
			УровеньЖурналаРегистрации.Предупреждение,
			?(ЗначениеЗаполнено(Заказ), Метаданные.Документы.ЗаказПокупателя, Неопределено),
			Заказ,
			"Сообщение отправлено, но в историю не записалось: " + ОписаниеОшибки());

	КонецПопытки;

КонецПроцедуры

// Дублирует запись об отправке на сайт - во вкладку админки "Уведомления 1С".
// Источник истины остаётся в регистре ТелеграмУведомления; сайту отдаём копию,
// чтобы историю можно было смотреть из браузера, не заходя в 1С.
//
// Сайт в отправке менеджеру не участвует вообще (1С шлёт своим ботом напрямую),
// поэтому строку в его журнал кладём отсюда, вызовом cron_manager_notify.php.
Процедура ЗеркалитьНаСайт(Знач Заказ, Знач ВидУведомления, Знач Текст)

	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат;
	КонецЕсли;

	Вид = ВидДляСайта(ВидУведомления);

	Если ПустаяСтрока(Вид) Тогда
		Возврат;
	КонецЕсли;

	Попытка

		Контрагент = Заказ.Контрагент;

		ТелоЗапроса = "token=" + БИАС.КодироватьПараметрPOST(ТокенСайта())
			+ "&event=sent"
			+ "&kind="  + БИАС.КодироватьПараметрPOST(Вид)
			+ "&order=" + БИАС.КодироватьПараметрPOST(СокрЛП(Заказ.Номер))
			+ "&code="  + БИАС.КодироватьПараметрPOST(СокрЛП(Строка(Контрагент.Код)))
			+ "&name="  + БИАС.КодироватьПараметрPOST(СокрЛП(Строка(Контрагент)))
			+ "&text="  + БИАС.КодироватьПараметрPOST(Текст);

		ЗапросКСайту(ТелоЗапроса, Заказ);

	Исключение

		// Зеркало не должно влиять на отправку: сообщение менеджеру уже ушло,
		// а история есть в регистре.
		ЗаписатьОшибку(Заказ, "Не удалось продублировать уведомление на сайт: "
			+ ОписаниеОшибки());

	КонецПопытки;

КонецПроцедуры

// Сообщает сайту, что менеджер нажал "Обработан" - чтобы во вкладке
// "Уведомления 1С" строка перестала висеть в "ждёт обработки".
Процедура ЗеркалитьОбработкуНаСайт(Знач Заказ, Знач Кто)

	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат;
	КонецЕсли;

	Попытка

		ТелоЗапроса = "token=" + БИАС.КодироватьПараметрPOST(ТокенСайта())
			+ "&event=handled"
			+ "&order=" + БИАС.КодироватьПараметрPOST(СокрЛП(Заказ.Номер))
			+ "&who="   + БИАС.КодироватьПараметрPOST(Кто);

		ЗапросКСайту(ТелоЗапроса, Заказ);

	Исключение

		ЗаписатьОшибку(Заказ, "Не удалось передать отметку обработки на сайт: "
			+ ОписаниеОшибки());

	КонецПопытки;

КонецПроцедуры

// Вид уведомления 1С -> параметр kind приёмника сайта.
Функция ВидДляСайта(Знач ВидУведомления)

	Если ВидУведомления = "НовыйЗаказ" Тогда
		Возврат "new";
	ИначеЕсли ВидУведомления = "ПросрочкаСтатуса" Тогда
		Возврат "late";
	КонецЕсли;

	Возврат "";

КонецФункции

// Приёмник на сайте и его секрет. Секрет тот же, что у уведомлений о резерве
// (БИАС.УведомитьСайтОРезерве) - граница доверия одна и та же.
// Хост и путь держим порознь: HTTPСоединению нужен хост, WinHttp - полный URL,
// а разбирать URL нечем (СтруктураURI в этой конфигурации нет).
Функция ХостСайта()

	Возврат "cvetkovtm.com";

КонецФункции

Функция ПутьПриемникаСайта()

	Возврат "/assets/shop/cron_manager_notify.php";

КонецФункции

Функция ТокенСайта()

	Возврат "e4cfdff6ad370ca2f0e26d8eb82bcda9";

КонецФункции

// POST на сайт: сначала штатным HTTPСоединением, при отказе - через WinHttp,
// ровно как в ВыполнитьЗапрос (какой способ доступен на сервере - выяснится
// только на живой базе).
Процедура ЗапросКСайту(Знач ТелоЗапроса, Знач Заказ)

	Адрес = "https://" + ХостСайта() + ПутьПриемникаСайта();

	Попытка

		Соединение = Новый HTTPСоединение(ХостСайта(), 443, , , , 30,
			Новый ЗащищенноеСоединениеOpenSSL);

		Запрос = Новый HTTPЗапрос(ПутьПриемникаСайта());
		Запрос.Заголовки.Вставить("Content-Type",
			"application/x-www-form-urlencoded; charset=UTF-8");
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8",
			ИспользованиеByteOrderMark.НеИспользовать);

		Ответ = Соединение.ОтправитьДляОбработки(Запрос);

		Если Ответ.КодСостояния < 200 Или Ответ.КодСостояния >= 300 Тогда
			ЗаписатьОшибку(Заказ, "Сайт ответил HTTP " + Строка(Ответ.КодСостояния)
				+ ": " + Лев(Ответ.ПолучитьТелоКакСтроку("UTF-8"), 500));
		КонецЕсли;

		Возврат;

	Исключение

		ОшибкаHTTPСоединения = ОписаниеОшибки();

	КонецПопытки;

	Попытка

		HTTP = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
		HTTP.Open("POST", Адрес, Ложь);
		HTTP.SetRequestHeader("Content-Type",
			"application/x-www-form-urlencoded; charset=UTF-8");
		HTTP.SetTimeouts(15000, 15000, 30000, 30000);
		HTTP.Send(ТелоЗапроса);

		КодСостояния = Число(HTTP.Status);

		Если КодСостояния < 200 Или КодСостояния >= 300 Тогда
			ЗаписатьОшибку(Заказ, "Сайт ответил HTTP " + Строка(КодСостояния)
				+ ": " + Лев(Строка(HTTP.ResponseText), 500));
		КонецЕсли;

	Исключение

		ЗаписатьОшибку(Заказ, "Сайт недоступен."
			+ Символы.ПС + "HTTPСоединение: " + ОшибкаHTTPСоединения
			+ Символы.ПС + "WinHttp: " + ОписаниеОшибки());

	КонецПопытки;

КонецПроцедуры

// Разбирает одно нажатие кнопки: отметка в истории, отметка в задаче,
// ответ Telegram и новая подпись кнопки под сообщением.
Процедура ОбработатьНажатие(Знач Токен, Знач Нажатие)

	ИДНажатия = СтрокаJSON(Нажатие, "id");
	Данные    = СтрокаJSON(Нажатие, "data");

	ЧатИД          = "";
	НомерСообщения = 0;

	Сообщение = Неопределено;
	Если Нажатие.Свойство("message", Сообщение) И ТипЗнч(Сообщение) = Тип("Структура") Тогда

		НомерСообщения = ЧислоJSON(Сообщение, "message_id");

		Чат = Неопределено;
		Если Сообщение.Свойство("chat", Чат) И ТипЗнч(Чат) = Тип("Структура") Тогда
			ЧатИД = СтрокаJSON(Чат, "id");
		КонецЕсли;

	КонецЕсли;

	// Кнопка уже отмеченного сообщения ("done") - просто закрываем "часики"
	// у менеджера, повторно ничего не пишем.
	Если Лев(Данные, 3) <> "ok:" Тогда
		ОтветитьНаНажатие(Токен, ИДНажатия, "Уже отмечено");
		Возврат;
	КонецЕсли;

	Заказ = ЗаказПоДаннымКнопки(Данные);

	Если Не ЗначениеЗаполнено(Заказ) Тогда
		ОтветитьНаНажатие(Токен, ИДНажатия, "Заказ не найден в 1С");
		Возврат;
	КонецЕсли;

	Кто           = КтоНажал(Нажатие);
	ДатаОбработки = ТекущаяДата();

	Задача = ОтметитьВИстории(ЧатИД, НомерСообщения, Заказ, ДатаОбработки, Кто);

	ОтметитьВЗадаче(Задача, Заказ, ДатаОбработки, Кто);

	ЗеркалитьОбработкуНаСайт(Заказ, Кто);

	ОтветитьНаНажатие(Токен, ИДНажатия,
		"Отмечено: " + Формат(ДатаОбработки, "ДФ='dd.MM.yyyy HH:mm'"));

	ОтметитьСообщение(Токен, ЧатИД, НомерСообщения, ДатаОбработки, Кто);

КонецПроцедуры

// Заказ по callback_data вида "ok:<UUID заказа>".
Функция ЗаказПоДаннымКнопки(Знач Данные)

	Идентификатор = СокрЛП(Сред(СокрЛП(Данные), 4));

	Если ПустаяСтрока(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Ссылка = Документы.ЗаказПокупателя.ПолучитьСсылку(
			Новый УникальныйИдентификатор(Идентификатор));
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	// Ссылка на несуществующий документ читается без ошибки, но пустыми
	// значениями реквизитов - по номеру и отличаем.
	Если ПустаяСтрока(СокрЛП(Ссылка.Номер)) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Ссылка;

КонецФункции

// Ставит отметку обработки в истории и возвращает задачу, к которой сообщение
// было привязано при отправке (Неопределено - привязки не было).
Функция ОтметитьВИстории(Знач ЧатИД, Знач НомерСообщения, Знач Заказ,
	Знач ДатаОбработки, Знач Кто)

	Если НомерСообщения = 0 Или ПустаяСтрока(ЧатИД) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка

		Запись = РегистрыСведений.ТелеграмУведомления.СоздатьМенеджерЗаписи();

		Запись.Заказ          = Заказ;
		Запись.Чат            = Лев(СокрЛП(Строка(ЧатИД)), 32);
		Запись.НомерСообщения = НомерСообщения;

		Запись.Прочитать();

		Если Не Запись.Выбран() Тогда

			// Записи нет - сообщение ушло до появления регистра. Заводим её
			// сейчас, чтобы отметка обработки не потерялась.
			Запись.Заказ          = Заказ;
			Запись.Чат            = Лев(СокрЛП(Строка(ЧатИД)), 32);
			Запись.НомерСообщения = НомерСообщения;
			Запись.ДатаОтправки   = ДатаОбработки;

		КонецЕсли;

		Запись.Обработан     = Истина;
		Запись.ДатаОбработки = ДатаОбработки;
		Запись.КтоОбработал  = Лев(Кто, 100);

		Запись.Записать(Истина);

		Возврат Запись.Задача;

	Исключение

		ЗаписатьОшибку(Заказ, "Не удалось отметить обработку в истории: " + ОписаниеОшибки());
		Возврат Неопределено;

	КонецПопытки;

КонецФункции

// Дописывает в задачу менеджера строку с датой обработки. Задачу не закрывает:
// закрытие - решение менеджера в 1С.
Процедура ОтметитьВЗадаче(Знач Задача, Знач Заказ, Знач ДатаОбработки, Знач Кто)

	Если Не ЗначениеЗаполнено(Задача) Тогда
		Задача = ЗадачаПоЗаказу(Заказ);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Задача) Тогда
		Возврат;
	КонецЕсли;

	ОбъектЗадачи = Задача.ПолучитьОбъект();

	Если ОбъектЗадачи = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Отметка = "✅ Обработан в Telegram "
		+ Формат(ДатаОбработки, "ДФ='dd.MM.yyyy HH:mm'");

	Если Не ПустаяСтрока(Кто) Тогда
		Отметка = Отметка + " - " + Кто;
	КонецЕсли;

	// Пишем в "Описание": это строка неограниченной длины. В "ДопИнформации"
	// всего 30 символов - отметка молча обрезалась бы.
	Если СтрНайти(ОбъектЗадачи.Описание, "✅ Обработан в Telegram") = 0 Тогда

		ОбъектЗадачи.Описание = ?(ПустаяСтрока(ОбъектЗадачи.Описание),
			"", ОбъектЗадачи.Описание + Символы.ПС) + Отметка;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(ОбъектЗадачи.ДатаИсполнения) Тогда
		ОбъектЗадачи.ДатаИсполнения = ДатаОбработки;
	КонецЕсли;

	Попытка
		ОбъектЗадачи.Записать();
	Исключение
		ЗаписатьОшибку(Заказ, "Не удалось записать отметку обработки в задачу: "
			+ ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

// Последняя незакрытая задача по заказу - на случай, когда сообщение отправили
// без привязки к задаче (уведомление о новом заказе).
Функция ЗадачаПоЗаказу(Знач Заказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗадачиПользователя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
		|ГДЕ
		|	ЗадачиПользователя.Объект = &Заказ
		|	И НЕ ЗадачиПользователя.Выполнена
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачиПользователя.Дата УБЫВ";

	Запрос.УстановитьПараметр("Заказ", Заказ);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Кто нажал кнопку: имя и @username из callback_query.from.
Функция КтоНажал(Знач Нажатие)

	Отправитель = Неопределено;

	Если Не Нажатие.Свойство("from", Отправитель)
		Или ТипЗнч(Отправитель) <> Тип("Структура") Тогда

		Возврат "";

	КонецЕсли;

	Представление = СокрЛП(СтрокаJSON(Отправитель, "first_name")
		+ " " + СтрокаJSON(Отправитель, "last_name"));

	ИмяПользователя = СтрокаJSON(Отправитель, "username");

	Если Не ПустаяСтрока(ИмяПользователя) Тогда
		Представление = СокрЛП(Представление + " @" + ИмяПользователя);
	КонецЕсли;

	Возврат Представление;

КонецФункции

// Ответ на нажатие: без него у менеджера крутятся "часики" на кнопке.
Процедура ОтветитьНаНажатие(Знач Токен, Знач ИДНажатия, Знач Текст)

	Если ПустаяСтрока(ИДНажатия) Тогда
		Возврат;
	КонецЕсли;

	Параметры = Новый Структура;
	Параметры.Вставить("callback_query_id", ИДНажатия);
	Параметры.Вставить("text", Текст);

	ВыполнитьЗапрос(Токен, "answerCallbackQuery", ВJSON(Параметры), Неопределено);

КонецПроцедуры

// Меняет подпись кнопки под уже отправленным сообщением на "✅ Обработан <дата>",
// чтобы в чате было видно, что заказ разобрали, и повторно не звонили.
Процедура ОтметитьСообщение(Знач Токен, Знач ЧатИД, Знач НомерСообщения,
	Знач ДатаОбработки, Знач Кто)

	Если ПустаяСтрока(ЧатИД) Или НомерСообщения = 0 Тогда
		Возврат;
	КонецЕсли;

	Надпись = "✅ Обработан " + Формат(ДатаОбработки, "ДФ='dd.MM HH:mm'");

	Если Не ПустаяСтрока(Кто) Тогда
		Надпись = Надпись + " - " + Кто;
	КонецЕсли;

	Кнопка = Новый Структура;
	Кнопка.Вставить("text", Лев(Надпись, 60));
	Кнопка.Вставить("callback_data", "done");

	Ряд = Новый Массив;
	Ряд.Добавить(Кнопка);

	Клавиатура = Новый Массив;
	Клавиатура.Добавить(Ряд);

	Разметка = Новый Структура;
	Разметка.Вставить("inline_keyboard", Клавиатура);

	Параметры = Новый Структура;
	Параметры.Вставить("chat_id", СокрЛП(Строка(ЧатИД)));
	Параметры.Вставить("message_id", НомерСообщения);
	Параметры.Вставить("reply_markup", Разметка);

	ВыполнитьЗапрос(Токен, "editMessageReplyMarkup", ВJSON(Параметры), Неопределено);

КонецПроцедуры

// Вызывает метод Bot API. Сначала штатным HTTPСоединением, при отказе - через WinHttp:
// в этой базе исходящий HTTPS уже ходит обоими способами (см. ОплатаПоСсылке и БИАС),
// а какой из них доступен на сервере - выяснится только на живой базе.
Функция ВыполнитьЗапрос(Знач Токен, Знач Метод, Знач ТелоЗапроса, Знач Заказ)

	Адрес = "/bot" + Токен + "/" + Метод;
	ТелоОтвета = "";

	Попытка

		Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , 30,
			Новый ЗащищенноеСоединениеOpenSSL);

		Запрос = Новый HTTPЗапрос(Адрес);
		Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		// Без BOM: с ним Telegram не разбирает JSON.
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);

		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");

	Исключение

		ОшибкаHTTPСоединения = ОписаниеОшибки();
		ТелоОтвета = "";

		Попытка

			HTTP = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
			HTTP.Open("POST", "https://api.telegram.org" + Адрес, Ложь);
			HTTP.SetRequestHeader("Content-Type", "application/json; charset=utf-8");
			HTTP.SetTimeouts(15000, 15000, 30000, 30000);
			HTTP.Send(ТелоЗапроса);

			ТелоОтвета = Строка(HTTP.ResponseText);

		Исключение

			ЗаписатьОшибку(Заказ, "Telegram недоступен (" + Метод + ")."
				+ Символы.ПС + "HTTPСоединение: " + ОшибкаHTTPСоединения
				+ Символы.ПС + "WinHttp: " + ОписаниеОшибки());

			Возврат Неопределено;

		КонецПопытки;

	КонецПопытки;

	Если ПустаяСтрока(СокрЛП(ТелоОтвета)) Тогда
		ЗаписатьОшибку(Заказ, "Telegram вернул пустой ответ (" + Метод + ").");
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Данные = ПрочитатьJSON(ЧтениеJSON, Ложь);
		ЧтениеJSON.Закрыть();
	Исключение
		ЗаписатьОшибку(Заказ, "Не удалось разобрать ответ Telegram (" + Метод + "): "
			+ ОписаниеОшибки() + Символы.ПС + Лев(ТелоОтвета, 1000));
		Возврат Неопределено;
	КонецПопытки;

	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		ЗаписатьОшибку(Заказ, "Telegram вернул неожиданный ответ (" + Метод + "): "
			+ Лев(ТелоОтвета, 1000));
		Возврат Неопределено;
	КонецЕсли;

	Возврат Данные;

КонецФункции

Функция ВJSON(Значение)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);

	Возврат ЗаписьJSON.Закрыть();

КонецФункции

// Телефон клиента в формате +380..., пригодном для звонка из Telegram.
Функция ТелефонДляЗвонка(Заказ)

	Телефон = СокрЛП(Строка(Заказ.ТелефонКонтрагента));

	// В заказах с сайта телефон кладётся в ТелефонКонтрагента1 (ОбменПокупателямиНашСайт).
	Если ПустаяСтрока(Телефон) Тогда
		Телефон = СокрЛП(Строка(Заказ.ТелефонКонтрагента1));
	КонецЕсли;

	Если ПустаяСтрока(Телефон) Тогда
		Телефон = СокрЛП(ОбщегоНазначения.ТелефонКонтрагента(Заказ.Контрагент));
	КонецЕсли;

	Цифры = "";
	Для Позиция = 1 По СтрДлина(Телефон) Цикл
		Символ = Сред(Телефон, Позиция, 1);
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			Цифры = Цифры + Символ;
		ИначеЕсли Символ = ";" Или Символ = "," Тогда
			// В реквизите может лежать несколько номеров - берём первый.
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если СтрДлина(Цифры) = 12 И Лев(Цифры, 3) = "380" Тогда
		Возврат "+" + Цифры;
	ИначеЕсли СтрДлина(Цифры) = 10 И Лев(Цифры, 1) = "0" Тогда
		Возврат "+38" + Цифры;
	ИначеЕсли СтрДлина(Цифры) = 9 Тогда
		Возврат "+380" + Цифры;
	КонецЕсли;

	// Формат не распознали - отдаём как есть, менеджер разберётся.
	Возврат ?(ПустаяСтрока(Цифры), "", Телефон);

КонецФункции

Функция АдресДоставки(Заказ)

	Адрес = СокрЛП(Строка(Заказ.АдресДоставки));

	Если ПустаяСтрока(Адрес) И ЗначениеЗаполнено(Заказ.АдресДоставкиНП) Тогда
		Адрес = СокрЛП(Строка(Заказ.АдресДоставкиНП));
	КонецЕсли;

	Возврат Адрес;

КонецФункции

// Экранирует символы, которые Telegram считает разметкой HTML.
Функция HTML(Знач Текст)

	Текст = СтрЗаменить(Текст, "&", "&amp;");
	Текст = СтрЗаменить(Текст, "<", "&lt;");
	Текст = СтрЗаменить(Текст, ">", "&gt;");

	Возврат Текст;

КонецФункции

Функция СтрокаJSON(Данные, Имя)

	Значение = Неопределено;
	Если Не Данные.Свойство(Имя, Значение) Или Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧЦ=20; ЧДЦ=0; ЧГ=0");
	КонецЕсли;

	Возврат СокрЛП(Строка(Значение));

КонецФункции

Функция ЧислоJSON(Данные, Имя)

	Значение = Неопределено;
	Если Не Данные.Свойство(Имя, Значение) Или Значение = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	КонецЕсли;

	Попытка
		Возврат Число(СокрЛП(Строка(Значение)));
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

Функция БулевоJSON(Данные, Имя)

	Значение = Неопределено;
	Если Не Данные.Свойство(Имя, Значение) Или Значение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Значение;
	КонецЕсли;

	ТекстЗначения = НРег(СокрЛП(Строка(Значение)));
	Возврат ТекстЗначения = "true" Или ТекстЗначения = "1" Или ТекстЗначения = "да";

КонецФункции

Процедура ЗаписатьОшибку(Заказ, Текст)

	ЗаписьЖурналаРегистрации("Телеграм.Ошибка",
		УровеньЖурналаРегистрации.Ошибка,
		?(ЗначениеЗаполнено(Заказ), Метаданные.Документы.ЗаказПокупателя, Неопределено),
		Заказ,
		Текст);

КонецПроцедуры

#КонецОбласти
